Repository: mohammed-naim/financial_app
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ar

source: No data provided
ar: لم يتم توفير أي بيانات

source: Account name is required
ar: اسم الحساب مطلوب

source: Currency is required
ar: العملة مطلوبة

source: Account created successfully
ar: تم إنشاء الحساب بنجاح

source: An unexpected error occurred
ar: حدث خطأ غير متوقع

source: Account not found or access denied
ar: الحساب غير موجود أو تم رفض الوصول

source: Account updated successfully
ar: تم تحديث الحساب بنجاح

source: Account Enabled Successfully
ar: تم تفعيل الحساب بنجاح

source: Account Disabled Successfully
ar: تم تعطيل الحساب بنجاح

source: There are operations associated with this account.
ar: هناك عمليات مرتبطة بهذا الحساب.

source: Account Deleted Successfully
ar: تم حذف الحساب بنجاح

source: Missing required fields
ar: حقول مطلوبة مفقودة

source: Amount must be greater than zero
ar: يجب أن يكون المبلغ أكبر من الصفر

source: Source account not found or access denied
ar: لم يتم العثور على حساب المصدر أو تم رفض الوصول

source: Destination account not found or access denied
ar: لم يتم العثور على حساب الوجهة أو تم رفض الوصول

source: Insufficient funds in source account
ar: رصيد غير كافٍ في حساب المصدر

source: Transfer completed successfully
ar: تم إكمال التحويل بنجاح

source: full name, email, and password are required
ar: الاسم الكامل والبريد الإلكتروني وكلمة المرور مطلوبة

source: User with this email already exists
ar: مستخدم بهذا البريد الإلكتروني موجود بالفعل

source: User registered successfully
ar: تم تسجيل المستخدم بنجاح

source: Email and password are required
ar: البريد الإلكتروني وكلمة المرور مطلوبان

source: Login successful
ar: تم تسجيل الدخول بنجاح

source: Invalid email or password
ar: بريد إلكتروني أو كلمة مرور غير صالحة

source: Logout successful
ar: تم تسجيل الخروج بنجاح

source: Category name and type are required
ar: اسم الفئة ونوعها مطلوبان

source: Category created successfully
ar: تم إنشاء الفئة بنجاح

source: Category not found or access denied
ar: الفئة غير موجودة أو تم رفض الوصول

source: Invalid category type
ar: نوع فئة غير صالح

source: Category updated successfully
ar: تم تحديث الفئة بنجاح

source: Category enabled successfully
ar: تم تفعيل الفئة بنجاح

source: Category Disable successfully
ar: تم تعطيل الفئة بنجاح

source: There are operations associated with this category.
ar: هناك عمليات مرتبطة بهذه الفئة.

source: Category Deleted Successfully
ar: تم حذف الفئة بنجاح

source: Invalid date format. Use YYYY-MM-DD
ar: تنسيق التاريخ غير صالح. استخدم YYYY-MM-DD

source: Invalid or missing date format. Use YYYY-MM-DD
ar: تنسيق التاريخ غير صالح أو مفقود. استخدم YYYY-MM-DD

source: Invalid interval. Choose from day, week, or month
ar: فترة غير صالحة. اختر من يوم أو أسبوع أو شهر

source: debt not found
ar: الدين غير موجود

source: Payment not found or access denied
ar: الدفعة غير موجودة أو تم رفض الوصول

source: request body is empty or some data lost
ar: نص الطلب فارغ أو فقدت بعض البيانات

source: Account or Debt not found or access denied
ar: الحساب أو الدين غير موجود أو تم رفض الوصول

source: You have paid all the debts
ar: لقد دفعت جميع الديون

source: You cannot pay more than the remaining amount
ar: لا يمكنك دفع أكثر من المبلغ المتبقي

source: Payment deleted successfully
ar: تم حذف الدفعة بنجاح

source: account or debt not found
ar: الحساب أو الدين غير موجود

source: payment not found or access denied
ar: الدفعة غير موجودة أو تم رفض الوصول

source: Type, person name, amount, and account are required
ar: النوع واسم الشخص والمبلغ والحساب مطلوبة

source: Debt added successfully
ar: تمت إضافة الدين بنجاح

source: Debt not found or access denied
ar: الدين غير موجود أو تم رفض الوصول

source: Debt updated successfully
ar: تم تحديث الدين بنجاح

source: There are payments associated with this debt.
ar: هناك دفعات مرتبطة بهذا الدين.

source: Debt deleted successfully
ar: تم حذف الدين بنجاح

source: Currency, account, amount invested and purchase price are required
ar: العملة والحساب والمبلغ المستثمر وسعر الشراء مطلوبة

source: Account not found
ar: الحساب غير موجود

source: Account not found or Access denied
ar: الحساب غير موجود أو تم رفض الوصول

source: Investment added successfully
ar: تمت إضافة الاستثمار بنجاح

source: Investment not found or access denied
ar: الاستثمار غير موجود أو تم رفض الوصول

source: Account can't be updated
ar: لا يمكن تحديث الحساب

source: Investment updated successfully
ar: تم تحديث الاستثمار بنجاح

source: Investment deleted successfully
ar: تم حذف الاستثمار بنجاح

source: bad request
ar: طلب غير صحيح

source: Notification not found or access denied
ar: الإشعار غير موجود أو تم رفض الوصول

source: Notification updated successfully
ar: تم تحديث الإشعار بنجاح

source: Account or Category not found or access denied
ar: الحساب أو الفئة غير موجود أو تم رفض الوصول

source: Something went wrong while adding repeated transaction
ar: حدث خطأ ما أثناء إضافة معاملة متكررة

source: Repeated transaction created successfully
ar: تم إنشاء المعاملة المتكررة بنجاح

source: Repeated transaction not found or access denied
ar: لم يتم العثور على المعاملة المتكررة أو تم رفض الوصول

source: Repeated transaction updated successfully
ar: تم تحديث المعاملة المتكررة بنجاح

source: Repeated transaction deleted successfully
ar: تم حذف المعاملة المتكررة بنجاح

source: language not found
ar: اللغة غير موجودة

source: Language changed successfully
ar: تم تغيير اللغة بنجاح

source: Amount, category, and account are required or body format is wrong
ar: المبلغ والفئة والحساب مطلوبة أو تنسيق النص خاطئ

source: Transaction created successfully
ar: تم إنشاء المعاملة بنجاح

source: Invalid date format. Use YYYY-MM-DD.
ar: تنسيق التاريخ غير صالح. استخدم YYYY-MM-DD.

source: Transaction not found or access denied
ar: المعاملة غير موجودة أو تم رفض الوصول

source: Amount, category, and account are required
ar: المبلغ والفئة والحساب مطلوبة

source: Transaction updated successfully
ar: تم تحديث المعاملة بنجاح

source: Transaction deleted successfully
ar: تم حذف المعاملة بنجاح

source: Transaction is not in processing status
ar: المعاملة ليست في حالة معالجة

source: Transaction processed successfully
ar: تمت معالجة المعاملة بنجاح

source: Accounts
ar: الحسابات

source: Manage your accounts efficiently. Add, edit, or transfer funds between them.
ar: أدر حساباتك بكفاءة. أضف أو حرر أو انقل الأموال بينها.

source: Filter Accounts
ar: تصفية الحسابات

source: All
ar: الكل

source: Enabled
ar: مفعل

source: Disabled
ar: معطل

source: Add Account
ar: إضافة حساب

source: Transfer
ar: تحويل

source: Name
ar: الاسم

source: Balance
ar: الرصيد

source: Currency
ar: العملة

source: Actions
ar: الإجراءات

source: Add New Account
ar: إضافة حساب جديد

source: Close
ar: إغلاق

source: Account Name
ar: اسم الحساب

source: e.g., My Savings
ar: مثال: مدخراتي

source: Initial Balance
ar: الرصيد الافتتاحي

source: e.g., 1000
ar: مثال: ١٠٠٠

source: Cancel
ar: إلغاء

source: Edit Account
ar: تعديل الحساب

source: Enter a new name
ar: أدخل اسماً جديداً

source: e.g., ILS
ar: مثال: شيكل

source: e.g., 1500
ar: مثال: ١٥٠٠

source: Save Changes
ar: حفظ التغييرات

source: Transfer Between Accounts
ar: تحويل بين الحسابات

source: From Account
ar: من الحساب

source: Select Account
ar: اختر حساباً

source: To Account
ar: إلى الحساب

source: Amount
ar: المبلغ

source: e.g., 500
ar: مثال: ٥٠٠

source: Are you sure you want to delete this account? This action cannot be undone.
ar: هل أنت متأكد أنك تريد حذف هذا الحساب؟ لا يمكن التراجع عن هذا الإجراء.

source: Are you sure you want to disable this account?
ar: هل أنت متأكد أنك تريد تعطيل هذا الحساب؟

source: Are you sure you want to enable this account?
ar: هل أنت متأكد أنك تريد تفعيل هذا الحساب؟

source: Account added successfully
ar: تمت إضافة الحساب بنجاح

source: Transfer completed
ar: تم إكمال التحويل

source: Account deleted successfully.
ar: تم حذف الحساب بنجاح.

source: Account disabled
ar: تم تعطيل الحساب

source: Account enabled
ar: تم تفعيل الحساب

source: Error fetching accounts from the server.
ar: حدث خطأ أثناء جلب الحسابات من الخادم.

source: An error occurred while updating the account.
ar: حدث خطأ أثناء تحديث الحساب.

source: An error occurred while adding the account.
ar: حدث خطأ أثناء إضافة الحساب.

source: An error occurred while transferring.
ar: حدث خطأ أثناء التحويل.

source: An error occurred while deleting the account.
ar: حدث خطأ أثناء حذف الحساب.

source: An error occurred while disabling the account.
ar: حدث خطأ أثناء تعطيل الحساب.

source: An error occurred while enabling the account.
ar: حدث خطأ أثناء تفعيل الحساب.

source: Enable
ar: تفعيل

source: Disable
ar: تعطيل

source: Edit
ar: تعديل

source: Delete
ar: حذف

source: Delete Account
ar: حذف الحساب

source: Disable Account
ar: تعطيل الحساب

source: Enable Account
ar: تفعيل الحساب

source: Money App
ar: تطبيق المال

source: Categories
ar: الفئات

source: Transactions
ar: المعاملات

source: Debts
ar: الديون

source: Investments
ar: الاستثمارات

source: Dashboard
ar: لوحة التحكم

source: No new notifications
ar: لا توجد إشعارات جديدة

source: Language
ar: اللغة

source: English
ar: الإنجليزية

source: Arabic
ar: العربية

source: Logout
ar: تسجيل الخروج

source: Money App. All Rights Reserved.
ar: جميع الحقوق محفوظة لتطبيق المال.

source: Confirm
ar: تأكيد

source: OK
ar: موافق

source: An error occurred while changing language.
ar: حدث خطأ أثناء تغيير اللغة.

source: An error occurred while logging out.
ar: حدث خطأ أثناء تسجيل الخروج.

source: Error fetching notifications.
ar: حدث خطأ أثناء جلب الإشعارات.

source: Error marking notification as read.
ar: حدث خطأ أثناء تعليم الإشعار كمقروء.

source: Manage your income and expense categories here.
ar: أدر فئات دخلك ونفقاتك هنا.

source: Filter by Type
ar: تصفية حسب النوع

source: Income
ar: الدخل

source: Expense
ar: المصروف

source: Sort by
ar: ترتيب حسب

source: Name (A-Z)
ar: الاسم (أ-ي)

source: Name (Z-A)
ar: الاسم (ي-أ)

source: Type
ar: النوع

source: Add Category
ar: إضافة فئة

source: Status
ar: الحالة

source: Category Name
ar: اسم الفئة

source: e.g., Food & Dining
ar: مثال: طعام ومطاعم

source: Add
ar: إضافة

source: Edit Category
ar: تعديل الفئة

source: Error loading categories.
ar: خطأ في تحميل الفئات.

source: An error occurred while disabling the category.
ar: حدث خطأ أثناء تعطيل الفئة.

source: An error occurred while adding the category.
ar: حدث خطأ أثناء إضافة الفئة.

source: An error occurred while updating the category.
ar: حدث خطأ أثناء تحديث الفئة.

source: An error occurred while deleting the category.
ar: حدث خطأ أثناء حذف الفئة.

source: An error occurred while enabling the category.
ar: حدث خطأ أثناء تفعيل الفئة.

source: Are you sure you want to disable this category?
ar: هل أنت متأكد أنك تريد تعطيل هذه الفئة؟

source: Are you sure you want to delete this category?
ar: هل أنت متأكد أنك تريد حذف هذه الفئة؟

source: Are you sure you want to enable this category?
ar: هل أنت متأكد أنك تريد تفعيل هذه الفئة؟

source: Category added successfully!
ar: تمت إضافة الفئة بنجاح!

source: Category updated successfully!
ar: تم تحديث الفئة بنجاح!

source: Category deleted successfully!
ar: تم حذف الفئة بنجاح!

source: Category enabled successfully!
ar: تم تفعيل الفئة بنجاح!

source: Category disabled successfully!
ar: تم تعطيل الفئة بنجاح!

source: Disable Category
ar: تعطيل الفئة

source: Delete Category
ar: حذف الفئة

source: Enable Category
ar: تفعيل الفئة

source: Statistics
ar: الإحصائيات

source: Expenses
ar: المصروفات

source: Account Balances
ar: أرصدة الحسابات

source: Creditor
ar: دائن

source: Debtor
ar: مدين

source: Total Invested
ar: إجمالي الاستثمار

source: Total Profit
ar: إجمالي الربح

source: Income vs. Expenses
ar: الدخل مقابل المصروفات

source: Category Summary
ar: ملخص الفئات

source: Cash Flow Over Time
ar: التدفق النقدي مع مرور الوقت

source: Start Date
ar: تاريخ البدء

source: End Date
ar: تاريخ الانتهاء

source: Interval
ar: الفترة

source: Daily
ar: يومي

source: Weekly
ar: أسبوعي

source: Monthly
ar: شهري

source: Apply Filter
ar: تطبيق الفلتر

source: Person Name
ar: اسم الشخص

source: All Types
ar: جميع الأنواع

source: Apply Filters
ar: تطبيق الفلاتر

source: Add Debt
ar: إضافة دين

source: Add New Debt
ar: إضافة دين جديد

source: Account
ar: الحساب

source: Save
ar: حفظ

source: Debt Payments
ar: دفعات الدين

source: Date
ar: التاريخ

source: Description
ar: الوصف

source: Add Payment
ar: إضافة دفعة

source: Edit Payment
ar: تعديل الدفعة

source: Error loading accounts.
ar: خطأ في تحميل الحسابات.

source: Error loading debts.
ar: خطأ في تحميل الديون.

source: Unknown
ar: مجهول

source: Paid
ar: مدفوع

source: Remaining
ar: متبقي

source: Payments
ar: الدفعات

source: Edit Debt
ar: تعديل الدين

source: Debt saved successfully.
ar: تم حفظ الدين بنجاح.

source: Error saving debt.
ar: خطأ في حفظ الدين.

source: Delete Debt
ar: حذف الدين

source: Are you sure you want to delete this debt?
ar: هل أنت متأكد أنك تريد حذف هذا الدين؟

source: Error deleting debt.
ar: خطأ في حذف الدين.

source: Error loading payments.
ar: خطأ في تحميل الدفعات.

source: No payments yet
ar: لا توجد دفعات حتى الآن

source: No description
ar: لا يوجد وصف

source: Error loading payment for edit.
ar: خطأ في تحميل الدفعة للتعديل.

source: Payment updated successfully.
ar: تم تحديث الدفعة بنجاح.

source: Error updating payment.
ar: خطأ في تحديث الدفعة.

source: Delete Payment
ar: حذف الدفعة

source: Are you sure you want to delete this payment?
ar: هل أنت متأكد أنك تريد حذف هذه الدفعة؟

source: Payment deleted successfully.
ar: تم حذف الدفعة بنجاح.

source: Error deleting payment.
ar: خطأ في حذف الدفعة.

source: Current Exchange Rates
ar: أسعار الصرف الحالية

source: Rate to ILS
ar: سعر الصرف مقابل الشيكل

source: Show/Hide Exchange Rates
ar: إظهار/إخفاء أسعار الصرف

source: Add Investment
ar: إضافة استثمار

source: Asset Currency
ar: عملة الأصل

source: Amount Invested
ar: المبلغ المستثمر

source: Purchase Price
ar: سعر الشراء

source: Profit / Loss
ar: الربح / الخسارة

source: Sold?
ar: هل تم البيع؟

source: USD
ar: دولار أمريكي

source: EUR
ar: يورو

source: JOD
ar: دينار أردني

source: Purchase Price (ILS)
ar: سعر الشراء (شيكل)

source: Reference Currency
ar: عملة المرجع

source: ILS
ar: شيكل إسرائيلي

source: Edit Investment
ar: تعديل الاستثمار

source: Update
ar: تحديث

source: Sell Investment
ar: بيع الاستثمار

source: Sell Price (ILS)
ar: سعر البيع (شيكل)

source: This defaults to the current price if available, but you can override.
ar: يتم افتراضياً استخدام السعر الحالي إذا كان متاحاً، ولكن يمكنك تغييره.

source: Sell
ar: بيع

source: Could not load exchange rates.
ar: تعذر تحميل أسعار الصرف.

source: Could not load accounts.
ar: تعذر تحميل الحسابات.

source: Error loading investments.
ar: خطأ في تحميل الاستثمارات.

source: Yes
ar: نعم

source: No
ar: لا

source: Error adding investment.
ar: خطأ في إضافة الاستثمار.

source: Error loading investment.
ar: خطأ في تحميل الاستثمار.

source: Investment updated successfully!
ar: تم تحديث الاستثمار بنجاح!

source: Error updating investment.
ar: خطأ في تحديث الاستثمار.

source: Delete Investment
ar: حذف الاستثمار

source: Are you sure you want to delete this investment?
ar: هل أنت متأكد أنك تريد حذف هذا الاستثمار؟

source: Investment deleted successfully!
ar: تم حذف الاستثمار بنجاح!

source: Error deleting investment.
ar: خطأ في حذف الاستثمار.

source: Error loading investment info.
ar: خطأ في تحميل معلومات الاستثمار.

source: Investment sold successfully!
ar: تم بيع الاستثمار بنجاح!

source: Error selling investment.
ar: خطأ في بيع الاستثمار.

source: Financial Growth
ar: النمو المالي

source: Track your financial journey
ar: تتبع رحلتك المالية

source: Email
ar: البريد الإلكتروني

source: Password
ar: كلمة المرور

source: Start Growing
ar: ابدأ بالنمو

source: Email and password are required.
ar: البريد الإلكتروني وكلمة المرور مطلوبان.

source: Begin your financial journey
ar: ابدأ رحلتك المالية

source: Full Name
ar: الاسم الكامل

source: Confirm Password
ar: تأكيد كلمة المرور

source: Create Account
ar: إنشاء حساب

source: Existing User? Sign In
ar: مستخدم حالي؟ تسجيل الدخول

source: Signup failed.
ar: فشل التسجيل.

source: Repeated Transactions
ar: المعاملات المتكررة

source: Category
ar: الفئة

source: Add Transaction
ar: إضافة معاملة

source: Add Repeated
ar: إضافة متكرر

source: Transaction pagination
ar: تصفح المعاملات

source: Total Transactions
ar: إجمالي المعاملات

source: Next Transaction
ar: المعاملة التالية

source: Period (Days)
ar: الفترة (أيام)

source: Edit Transaction
ar: تعديل المعاملة

source: Add Repeated Transaction
ar: إضافة معاملة متكررة

source: Process
ar: معالجة

source: First
ar: الأول

source: Last
ar: الاخير

source: An error occurred while adding the transaction.
ar: حدث خطأ أثناء إضافة المعاملة.

source: Delete Transaction
ar: حذف المعاملة

source: Are you sure you want to delete this transaction?
ar: هل أنت متأكد أنك تريد حذف هذه المعاملة؟

source: An error occurred while deleting the transaction.
ar: حدث خطأ أثناء حذف المعاملة.

source: Process Transaction
ar: معالجة المعاملة

source: This transaction is currently processing. Do you want to finalize it now?
ar: هذه المعاملة قيد المعالجة. هل تريد إتمامها الآن؟

source: An error occurred while processing the transaction.
ar: حدث خطأ أثناء معالجة المعاملة.

source: Error loading repeated transactions.
ar: خطأ في تحميل المعاملات المتكررة.

source: An error occurred while adding repeated transaction.
ar: حدث خطأ أثناء إضافة معاملة متكررة.

source: An error occurred while fetching repeated transaction.
ar: حدث خطأ أثناء جلب المعاملة المتكررة.

source: An error occurred while editing repeated transaction.
ar: حدث خطأ أثناء تعديل المعاملة المتكررة.

source: Delete Repeated Transaction
ar: حذف المعاملة المتكررة

source: Are you sure you want to delete this repeated transaction?
ar: هل أنت متأكد أنك تريد حذف هذه المعاملة المتكررة؟

source: An error occurred while deleting repeated transaction.
ar: حدث خطأ أثناء حذف المعاملة المتكررة.
